snappyTestRectTry/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    rectCylinder01.stl  //STL filename
    {
        type triSurfaceMesh;
        name        cylinder;
        regions
        {
            StoneyDesigner_solid
            {
                 name       cylinder;
            }
        }     
    }

//練習：領域を指定して再分割しよう。(1)
//    refinementBox
//    {
//        type searchableBox;
//        min (0.025 0.015 0.0 );
//        max (0.045 0.035 0.01);
//    }
};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 1;  //3;
    features
    (
        {
            file "rectCylinder01.eMesh";
            level 2;
        }
    );
    refinementSurfaces
    {
        cylinder
        {
            // Surface-wise min and max refinement level
           level (2 2);
//練習：表面再分割のレベルを変更してみよう
//             level (3 3);
        }
    }

    resolveFeatureAngle 60;

    refinementRegions
    {
        cylinder
        {
            mode distance;
            levels ( (0.01 1) );
//練習：領域再分割のレベルを２段階に変更してみよう
//            levels ( (0.007 2) (0.015 1) );
        }

//練習：領域を指定して再分割しよう。(2)
//        refinementBox
//        {
//            mode inside;
//            levels ((1E15 2));
//        }
    }

    locationInMesh (0.0001 0.0001 0.0001);

    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}


// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
    layers
    {
//練習：レイヤーを追加してみよう
        "cylinder"
        {
            nSurfaceLayers 2;
        }
    }

    expansionRatio 1.0;
    finalLayerThickness 0.3; 
    minThickness 0.1;
    nGrow 0;
    featureAngle 60; //30; 
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-30; 
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}


debug 0;
mergeTolerance 1e-6;

// ************************************************************************* //
