snappyTestRectTry/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    xMin //inlet      
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    xMax //outlet    
    {
        type            zeroGradient;
    }
    yMin      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    yMax      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    zMin      
    {
        type            cyclic;
    }
    zMax    
    {
        type            cyclic;
    }
    cylinder      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
